---
kind: property
id: P:Autodesk.Revit.DB.ThermalAsset.TransmitsLight
source: html/0ce64130-b515-81ad-f092-39fa46ee22bb.htm
---
# Autodesk.Revit.DB.ThermalAsset.TransmitsLight Property

A boolean flag that indicates whether or not the asset transmits light.

## Syntax (C#)
```csharp
public bool TransmitsLight { get; set; }
```